# Converting to Date time

In [1]:
import pandas as pd
import numpy as np

In [2]:
d1 = ['2 June 2013', 'Aug 29, 2014', '2015-06-26', '7/12/16']

# Generate random data
ts3 = pd.DataFrame(np.random.randint(10, 100, (4, 2)), index=d1, columns=list('ab'))

ts3

               a   b
2 June 2013   74  53
Aug 29, 2014  30  32
2015-06-26    59  87
7/12/16       66  79

In [4]:
# Using pandas to_datetime(), pandas will try to convert these to DateTime and put them in 
# a standard format.

ts3.index = pd.to_datetime(ts3.index)
ts3

             a   b
2013-06-02  74  53
2014-08-29  30  32
2015-06-26  59  87
2016-07-12  66  79

# Timedelta

In [6]:
# Timedeltas are differences in times. For instance, if we want to get the difference between Sept 3 
# and Sept 1, we get a timedelta of 2 days.

In [7]:
pd.Timestamp('9/3/2022')-pd.Timestamp('9/1/22')

Timedelta('2 days 00:00:00')

In [8]:
# We can find what the date and time is for 12 days and three hours past Sept 2nd at 8:10am.
pd.Timestamp('9/2/22 8:10AM') + pd.Timedelta('12D 3H')

Timestamp('2022-09-14 11:10:00')

# Offset

In [10]:
# Similar to timedelta, but follows specific calendar duration times.

pd.Timestamp('9/4/2022').weekday()

6

In [11]:
# Add the timestamp with weekahead
pd.Timestamp('9/4/2022') + pd.offsets.Week()

Timestamp('2022-09-11 00:00:00')

In [12]:
# Month end
pd.Timestamp('9/4/2022') + pd.offsets.MonthEnd()

Timestamp('2022-09-30 00:00:00')

# Working with Datetimes in DF

In [13]:
# Look at nine measurements, taken bi-weekly, every Sunday, starting in October 2016
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
dates

DatetimeIndex(['2016-10-02', '2016-10-16', '2016-10-30', '2016-11-13',
               '2016-11-27', '2016-12-11', '2016-12-25', '2017-01-08',
               '2017-01-22'],
              dtype='datetime64[ns]', freq='2W-SUN')

In [14]:
# Many other frequencies can be specified. For example, you can do business day.
pd.date_range('10-01-2016', periods=9, freq='B')

DatetimeIndex(['2016-10-03', '2016-10-04', '2016-10-05', '2016-10-06',
               '2016-10-07', '2016-10-10', '2016-10-11', '2016-10-12',
               '2016-10-13'],
              dtype='datetime64[ns]', freq='B')

In [15]:
# Or you can do quarterly, with the quarter start in June
pd.date_range('04-01-2016', periods=12, freq='QS-JUN')

DatetimeIndex(['2016-06-01', '2016-09-01', '2016-12-01', '2017-03-01',
               '2017-06-01', '2017-09-01', '2017-12-01', '2018-03-01',
               '2018-06-01', '2018-09-01', '2018-12-01', '2019-03-01'],
              dtype='datetime64[ns]', freq='QS-JUN')

In [19]:
# Create dates and random data
dates = pd.date_range('10-01-2016', periods=9, freq='2W-SUN')
df = pd.DataFrame({'Count 1': 100 + np.random.randint(-5, 10, 9).cumsum(),
                  'Count 2': 120 + np.random.randint(-5, 10, 9)}, index=dates)
df

            Count 1  Count 2
2016-10-02       98      126
2016-10-16       95      118
2016-10-30       90      129
2016-11-13       88      129
2016-11-27       86      119
2016-12-11       95      124
2016-12-25       96      121
2017-01-08       94      128
2017-01-22       98      121

In [28]:
df.index.weekday

Int64Index([6, 6, 6, 6, 6, 6, 6, 6, 6], dtype='int64')

In [30]:
# Find the difference between each date's value
df.diff()

            Count 1  Count 2
2016-10-02      NaN      NaN
2016-10-16     -3.0     -8.0
2016-10-30     -5.0     11.0
2016-11-13     -2.0      0.0
2016-11-27     -2.0    -10.0
2016-12-11      9.0      5.0
2016-12-25      1.0     -3.0
2017-01-08     -2.0      7.0
2017-01-22      4.0     -7.0

In [31]:
# Suppose we want to know what the mean count is for each month in our DataFrame. We can do this with resample
# i.e. We're downsampling from higher frequency (D) to lower frequency (M)

df.resample('M').mean()

              Count 1     Count 2
2016-10-31  94.333333  124.333333
2016-11-30  87.000000  124.000000
2016-12-31  95.500000  122.500000
2017-01-31  96.000000  124.500000

In [40]:
# datetime indexing and slicing
#By year
df.loc['2017']

            Count 1  Count 2
2017-01-08       94      128
2017-01-22       98      121

In [39]:
# My year-mo
df.loc['2016-12']

            Count 1  Count 2
2016-12-11       95      124
2016-12-25       96      121

In [42]:
# From 2016 onwards
df.loc['2016-12':]

            Count 1  Count 2
2016-12-11       95      124
2016-12-25       96      121
2017-01-08       94      128
2017-01-22       98      121